export const TYPE_EN = {
  '노말':'Normal','불꽃':'Fire','물':'Water','전기':'Electric',
  '풀':'Grass','얼음':'Ice','격투':'Fighting','독':'Poison',
  '땅':'Ground','비행':'Flying','에스퍼':'Psychic','벌레':'Bug',
  '바위':'Rock','고스트':'Ghost','드래곤':'Dragon','악':'Dark',
  '강철':'Steel','페어리':'Fairy','없음':'None'
};

export const TCOL = {
  '노말':'#9A9A7A','불꽃':'#E8622A','물':'#4A78E0','전기':'#C8A000',
  '풀':'#4A9228','얼음':'#4AACAC','격투':'#921818','독':'#722872',
  '땅':'#C09040','비행':'#6060CC','에스퍼':'#C83060','벌레':'#6A8A08',
  '바위':'#8A7820','고스트':'#4A3870','드래곤':'#4418D8','악':'#4A3428',
  '강철':'#7A7A92','페어리':'#C85898','없음':'#999'
};

export const TICON = {
  '노말':'⬜','불꽃':'🔥','물':'💧','전기':'⚡','풀':'🌿','얼음':'❄️',
  '격투':'🥊','독':'☠️','땅':'🌍','비행':'🌪️','에스퍼':'🔮','벌레':'🐛',
  '바위':'🪨','고스트':'👻','드래곤':'🐲','악':'🌑','강철':'⚙️','페어리':'🌸','없음':'—'
};
